import { FC } from "react";

import { Navbar, TextSection, Footer } from "../../components";

import {
  AboutHeaderSection,
  AboutImageSection,
  AboutFindUsSection,
} from "../../components/About";

import { pieManufacturing } from "../../assets";

const About: FC = () => {
  return (
    <>
      <Navbar showImage={false} />
      <AboutHeaderSection />
      <TextSection
        title="Η Τέχνη της Κρέπας"
        paragraphs={[
          "Πιστεύουμε ότι η δημιουργία της κρέπας αποτελεί τέχνη, η οποία απαιτεί συγκεκριμένη κατάρτιση. Γι'αυτό χρησιμοποιούμε παραδοσιακές συνταγές και τεχνικές, οι οποίες εκτελούνται από τους ταλαντούχους κρεπιέρηδες που στελεχώνουν την κουζίνα μας.",
          "Εκτός από το κύριο μενού μας, θα βρείτε συχνά και special προϊόντα διαθέσιμα για περιορισμένο χρονικό διάστημα. Παρακολουθήστε τα ΝΕΑ μας για να μη χάσετε καμία από τις λαχταριστές κρέπες μας!",
        ]}
        note="*Για πληροφορίες σχετικά με αλλεργιογόνα συστατικά τροφίμων επικοινωνήστε μαζί μας, ώστε να σας ενημερώσουμε αναλυτικά για όλα τα συστατικά που χρησιμοποιούνται σε κάθε προϊόν"
      />
      <AboutImageSection imageUrl={pieManufacturing} />
      <TextSection
        alignRight
        title="Αλμυρές Κρέπες"
        paragraphs={[
          "Είμαστε υπερήφανοι για τις αλμυρές μας κρέπες, και εργαζόμαστε σκληρά για να φέρουμε τη μοναδική τους γεύση και ποιότητα ...από τη Γαλλία, αποκλειστικά για εσάς στην Αθήνα!",
          "Δημιουργούνται αποκλειστικά από εμάς, χρησιμοποιώντας τη δική μας παραδοσιακή συνταγή. Αυτό που τις κάνει ξεχωριστές, εκτός φυσικά από τη γεύση τους, είναι το θρεπτικό, χωρίς γλουτένη, αλεύρι που χρησιμοποιούμε.",
        ]}
      />
      <TextSection
        title="Γλυκές Κρέπες"
        paragraphs={[
          "Οι γλυκές μας Γαλλικές κρέπες είναι λεπτές και τραγανές στην άκρη, αλλά αφράτες και απαλές στη μέση.",
          "Χρησιμοποιύμε το ξεχωριστό μας αλεύρι απευθείας από παραγωγούς, φρέσκο γάλα και ποιοτικά αυγά. Τα υλικά μας είναι όλα χειροποίητα και φτιαγμένα από εμάς, από τις διάφορες πραλίνες μέχρι και τα σιρόπια και τα εξαιρετικά παγωτά που χρησιμοποιούμε.",
        ]}
      />
      <AboutFindUsSection />
      <Footer />
    </>
  );
};

export default About;
